In [1]:
#introducing a new "DateOfBirth(age)" column in  data/null_value_imputed_data1.csv that will calculate the DoB of the person based on age at the time of data collection 
#  "DateOfBirth(age)" = date_today - age
#  "DateOfBirth(age)" will contain data in (YYYY-MM) format

In [3]:
from datetime import datetime, timedelta
import pandas as pd
import numpy as np

In [6]:
data1 = pd.read_csv("/home/theghost001/Pictures/practice_with_H/data/null_value_imputed_data1.csv",encoding='ascii')

In [7]:
data1.insert(1, "DateOfBirth(age)", None)

In [11]:
for index, row in data1.iterrows():
    data1.loc[index, 'DateOfBirth(age)'] = (datetime.today() - timedelta(days = 365.25*row['Age'])).strftime('%Y-%m')

In [12]:
data1.head()

,CustomerID,DateOfBirth(age),ProdTaken,Age,TypeofContact,CityTier,DurationOfPitch,Occupation,Gender,Totalvisiting
0,200000,1984-01,1,41.0,Self Enquiry,3,6.0,Salaried,Female,3.0
1,200001,1976-01,0,49.0,Company Invited,1,14.0,Salaried,Male,5.0
2,200002,1988-01,1,37.0,Self Enquiry,1,8.0,Free Lancer,Male,3.0
3,200003,1992-01,0,33.0,Company Invited,1,9.0,Salaried,Female,3.0
4,200004,1989-01,0,36.0,Self Enquiry,1,8.0,Small Business,Male,2.0

In [13]:
data1['DateOfBirth(age)'].value_counts()

DateOfBirth(age)
1989-01    457
1990-01    237
1991-01    211
1994-01    203
1995-01    199
1993-01    197
1992-01    189
1988-01    185
1996-01    178
1987-01    176
1984-01    155
1986-01    150
1997-01    147
1985-01    146
1983-01    142
1998-01    138
1982-01    130
1979-01    121
1980-01    116
1999-01    106
1981-01    105
1974-01     90
1978-01     88
1975-01     86
2000-01     74
1973-01     68
1972-01     66
1976-01     65
1977-01     65
1970-01     64
1971-01     61
1969-01     58
2001-01     56
2002-01     46
2003-01     46
1966-01     44
2004-01     41
2005-01     38
2006-01     32
1967-01     31
1968-01     29
1965-01     29
2007-01     14
1964-01      9
Name: count, dtype: int64

In [14]:
data1.to_csv("/home/theghost001/Pictures/practice_with_H/data/null_value_imputed_data1.csv", index=False)

In [15]:
data1.columns

Index(['CustomerID', 'DateOfBirth(age)', 'ProdTaken', 'Age', 'TypeofContact',
       'CityTier', 'DurationOfPitch', 'Occupation', 'Gender', 'Totalvisiting'],
      dtype='object')

In [16]:
data2 = pd.read_csv("/home/theghost001/Pictures/practice_with_H/data/null_value_imputed_data2.csv",encoding='ascii')

In [17]:
data2.columns

Index(['CustomerID', 'NumberOfFollowups', 'ProductPitched',
       'PreferredPropertyStar', 'MaritalStatus', 'NumberOfTrips', 'Passport',
       'PitchSatisfactionScore', 'OwnCar', 'Designation', 'MonthlyIncome'],
      dtype='object')

In [18]:
from datetime import datetime,timedelta
now = datetime.now()
print(now)
startDate = datetime(2010,1,1)
endDate = datetime(2015,12,31)
timeBetweenDates = endDate - startDate
print('time betwen dates is {}'.format(timeBetweenDates))
daysBetweenDates = timeBetweenDates.days
print('days between dates is {}'.format(daysBetweenDates))

2025-01-17 23:14:38.139344
time betwen dates is 2190 days, 0:00:00
days between dates is 2190

In [20]:
for index, row in data1.iterrows():
    randomNumberOfDays = int(np.random.rand() * daysBetweenDates)
    randomDate = startDate + timedelta(days=randomNumberOfDays)
    data1.loc[index, 'DateofBirth'] = randomDate

In [21]:
data1.columns

Index(['CustomerID', 'DateOfBirth(age)', 'ProdTaken', 'Age', 'TypeofContact',
       'CityTier', 'DurationOfPitch', 'Occupation', 'Gender', 'Totalvisiting',
       'DateofBirth'],
      dtype='object')

In [25]:
data1['DateofBirth'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 4888 entries, 0 to 4887
Series name: DateofBirth
Non-Null Count  Dtype
--------------  -----
4888 non-null   datetime64[us]
dtypes: datetime64[us](1)
memory usage: 38.3 KB

In [26]:
#updating data!
data1.to_csv("/home/theghost001/Pictures/practice_with_H/data/null_value_imputed_data1.csv", index=False)

In [27]:
data1.head()

,CustomerID,DateOfBirth(age),ProdTaken,Age,TypeofContact,CityTier,DurationOfPitch,Occupation,Gender,Totalvisiting,DateofBirth
0,200000,1984-01,1,41.0,Self Enquiry,3,6.0,Salaried,Female,3.0,2015-04-28
1,200001,1976-01,0,49.0,Company Invited,1,14.0,Salaried,Male,5.0,2010-02-19
2,200002,1988-01,1,37.0,Self Enquiry,1,8.0,Free Lancer,Male,3.0,2013-09-11
3,200003,1992-01,0,33.0,Company Invited,1,9.0,Salaried,Female,3.0,2011-11-12
4,200004,1989-01,0,36.0,Self Enquiry,1,8.0,Small Business,Male,2.0,2014-01-19

## inserting "Year","Month","Date" column in Data1 using "DateOfBirth" column in Data1

In [5]:
data1.head()

,CustomerID,DateOfBirth(age),ProdTaken,Age,TypeofContact,CityTier,DurationOfPitch,Occupation,Gender,Totalvisiting,DateofBirth
0,200000,1984-01,1,41.0,Self Enquiry,3,6.0,Salaried,Female,3.0,2015-04-28
1,200001,1976-01,0,49.0,Company Invited,1,14.0,Salaried,Male,5.0,2010-02-19
2,200002,1988-01,1,37.0,Self Enquiry,1,8.0,Free Lancer,Male,3.0,2013-09-11
3,200003,1992-01,0,33.0,Company Invited,1,9.0,Salaried,Female,3.0,2011-11-12
4,200004,1989-01,0,36.0,Self Enquiry,1,8.0,Small Business,Male,2.0,2014-01-19

In [4]:
data1 = pd.read_csv("/home/theghost001/Pictures/practice_with_H/data/null_value_imputed_data1.csv",encoding='ascii')

In [7]:
data1['DateofBirth']

0       2015-04-28
1       2010-02-19
2       2013-09-11
3       2011-11-12
4       2014-01-19
           ...
4883    2013-08-11
4884    2011-12-26
4885    2014-01-14
4886    2012-08-30
4887    2010-09-06
Name: DateofBirth, Length: 4888, dtype: object

In [8]:
data1['DateofBirth'] = pd.to_datetime(data1['DateofBirth'])

In [11]:
data1['Date(birth)'] = data1['DateofBirth'].dt.day
data1['Month(birth)'] = data1['DateofBirth'].dt.month
data1['Year(birth)'] = data1['DateofBirth'].dt.year

In [12]:
data1.head()

,CustomerID,DateOfBirth(age),ProdTaken,Age,TypeofContact,CityTier,DurationOfPitch,Occupation,Gender,Totalvisiting,DateofBirth,Date(birth),Month(birth),Year(birth)
0,200000,1984-01,1,41.0,Self Enquiry,3,6.0,Salaried,Female,3.0,2015-04-28,28,4,2015
1,200001,1976-01,0,49.0,Company Invited,1,14.0,Salaried,Male,5.0,2010-02-19,19,2,2010
2,200002,1988-01,1,37.0,Self Enquiry,1,8.0,Free Lancer,Male,3.0,2013-09-11,11,9,2013
3,200003,1992-01,0,33.0,Company Invited,1,9.0,Salaried,Female,3.0,2011-11-12,12,11,2011
4,200004,1989-01,0,36.0,Self Enquiry,1,8.0,Small Business,Male,2.0,2014-01-19,19,1,2014

## .Create a new column for "Alias" with the initials of each individual's "Type of Contact."

In [13]:
data1['TypeofContact'].value_counts()

TypeofContact
Self Enquiry       3469
Company Invited    1419
Name: count, dtype: int64

In [14]:
data1['TypeofContact'].unique()

array(['Self Enquiry', 'Company Invited'], dtype=object)

In [18]:
#data1['TypeofContact'] = data1['TypeofContact'].replace({'Self Enquiry': 'SE', 'Company Invited': 'CI'})
alias_mapping = {
    'Self Enquiry': 'SE',
    'Company Invited': 'CI'
}

In [19]:
data1['TypeofContact(Allias)'] = data1['TypeofContact'].map(alias_mapping)

In [20]:
data1.head()

,CustomerID,DateOfBirth(age),ProdTaken,Age,TypeofContact,CityTier,DurationOfPitch,Occupation,Gender,Totalvisiting,DateofBirth,Date(birth),Month(birth),Year(birth),TypeofContact(Allias)
0,200000,1984-01,1,41.0,Self Enquiry,3,6.0,Salaried,Female,3.0,2015-04-28,28,4,2015,SE
1,200001,1976-01,0,49.0,Company Invited,1,14.0,Salaried,Male,5.0,2010-02-19,19,2,2010,CI
2,200002,1988-01,1,37.0,Self Enquiry,1,8.0,Free Lancer,Male,3.0,2013-09-11,11,9,2013,SE
3,200003,1992-01,0,33.0,Company Invited,1,9.0,Salaried,Female,3.0,2011-11-12,12,11,2011,CI
4,200004,1989-01,0,36.0,Self Enquiry,1,8.0,Small Business,Male,2.0,2014-01-19,19,1,2014,SE

In [23]:
data1['TypeofContact(Allias)'].isnull().sum()

np.int64(0)

In [24]:
data1.to_csv("/home/theghost001/Pictures/practice_with_H/data/null_value_imputed_data1.csv", index=False)

In [25]:
data1.head()

,CustomerID,DateOfBirth(age),ProdTaken,Age,TypeofContact,CityTier,DurationOfPitch,Occupation,Gender,Totalvisiting,DateofBirth,Date(birth),Month(birth),Year(birth),TypeofContact(Allias)
0,200000,1984-01,1,41.0,Self Enquiry,3,6.0,Salaried,Female,3.0,2015-04-28,28,4,2015,SE
1,200001,1976-01,0,49.0,Company Invited,1,14.0,Salaried,Male,5.0,2010-02-19,19,2,2010,CI
2,200002,1988-01,1,37.0,Self Enquiry,1,8.0,Free Lancer,Male,3.0,2013-09-11,11,9,2013,SE
3,200003,1992-01,0,33.0,Company Invited,1,9.0,Salaried,Female,3.0,2011-11-12,12,11,2011,CI
4,200004,1989-01,0,36.0,Self Enquiry,1,8.0,Small Business,Male,2.0,2014-01-19,19,1,2014,SE